![png](Data/movies-erd.png)

In [1]:
from sqlalchemy.engine import create_engine
import pymysql
pymysql.install_as_MySQLdb()

import pandas as pd

In [2]:
# create sqlalchemy engine and connection
username = "root"
password = "root"
db_name = "movies"

connection = f"mysql+pymysql://{username}:{password}@localhost/{db_name}"

engine = create_engine(connection)

conn = engine.connect()

In [3]:
# run query to show all tables
q = """
    SHOW TABLES;
    """
pd.read_sql(q, conn)

          Tables_in_movies
0                   genres
1                  ratings
2             title_basics
3  title_basics_has_genres

In [4]:
# use DESCRIBE table command to display genres column details

q = """
    DESCRIBE genres;
    """
describe = pd.read_sql(q, conn)

describe

        Field         Type Null  Key Default           Extra
0    genre_id          int   NO  PRI    None  auto_increment
1  genre_name  varchar(45)  YES         None

In [5]:
# use DESCRIBE table command to display ratings column details

q = """
    DESCRIBE ratings;
    """
describe = pd.read_sql(q, conn)

describe

                 Field         Type Null  Key Default Extra
0               tconst  varchar(10)   NO  PRI    None
1       average_rating        float  YES         None
2      number_of_votes          int  YES         None
3  title_basics_tconst  varchar(10)  YES         None

In [6]:
# use DESCRIBE table command to display title_basics column details

q = """
    DESCRIBE title_basics;
    """
describe = pd.read_sql(q, conn)

describe

           Field          Type Null  Key Default Extra
0         tconst   varchar(10)   NO  PRI    None
1  primary_title  varchar(242)  YES         None
2     start_year          year  YES         None
3        runtime           int  YES         None

In [7]:
# use DESCRIBE table command to display title_basics_has_genres column details

q = """
    DESCRIBE genres;
    """
describe = pd.read_sql(q, conn)

describe

        Field         Type Null  Key Default           Extra
0    genre_id          int   NO  PRI    None  auto_increment
1  genre_name  varchar(45)  YES         None

In [8]:
# Changing the setting for FOREIGN_KEY_CHECKS with the connection

# q = """SET @@FOREIGN_KEY_CHECKS=0"""
# conn.execute(q)

In [9]:
# import tables from CSV files

ratings = pd.read_csv('Data/ratings.csv')
title_basics = pd.read_csv('Data/basics.csv')

In [10]:
# drop "unname:0" columns
ratings = ratings.drop("Unnamed: 0", axis=1)
title_basics = title_basics.drop("Unnamed: 0", axis=1)

In [11]:
# drop title_basics columns
title_basics = title_basics[['tconst', 'primaryTitle', 'startYear', 'runtimeMinutes']]

# verify changes
title_basics

,tconst,primaryTitle,startYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001.0,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70
2,tt0069049,The Other Side of the Wind,2018.0,122
3,tt0088751,The Naked Monster,2005.0,100
4,tt0096056,Crime and Punishment,2002.0,126
...,...,...,...,...
86974,tt9914942,Life Without Sara Amat,2019.0,74
86975,tt9915872,The Last White Witch,2019.0,97
86976,tt9916170,The Rehearsal,2019.0,51
86977,tt9916190,Safeguard,2020.0,95
86978,tt9916362,Coven,2020.0,92

In [12]:
# rename title_basics columns
rename_map = {"primaryTitle":"primary_title",
              "startYear":"start_year",
              "runtimeMinutes":"runtime"
             }
title_basics = title_basics.rename(rename_map, axis=1)

# verify changes
title_basics

,tconst,primary_title,start_year,runtime
0,tt0035423,Kate & Leopold,2001.0,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70
2,tt0069049,The Other Side of the Wind,2018.0,122
3,tt0088751,The Naked Monster,2005.0,100
4,tt0096056,Crime and Punishment,2002.0,126
...,...,...,...,...
86974,tt9914942,Life Without Sara Amat,2019.0,74
86975,tt9915872,The Last White Witch,2019.0,97
86976,tt9916170,The Rehearsal,2019.0,51
86977,tt9916190,Safeguard,2020.0,95
86978,tt9916362,Coven,2020.0,92

In [13]:
# rename ratings columns
rename_map = {"averageRating":"average_rating",
              "numVotes":"number_of_votes"
             }

ratings = ratings.rename(rename_map, axis=1)

# verify changes
ratings

          tconst  average_rating  number_of_votes
0      tt0035423             6.4            87153
1      tt0062336             6.4              175
2      tt0069049             6.7             7754
3      tt0088751             5.2              336
4      tt0096056             5.6              846
...          ...             ...              ...
71895  tt9914942             6.6              178
71896  tt9915872             6.4                9
71897  tt9916170             7.0                7
71898  tt9916190             3.7              243
71899  tt9916362             6.4             5422

[71900 rows x 3 columns]

In [14]:
# # append data to tables
ratings.to_sql("ratings",conn,index=False, if_exists='append')
title_basics.to_sql("title_basics",conn,index=False, if_exists='append')

86979

In [15]:
# run SHOW TABLES to verify table names have not been changed
q = """
    SHOW TABLES;
    """
pd.read_sql(q, conn)

          Tables_in_movies
0                   genres
1                  ratings
2             title_basics
3  title_basics_has_genres

In [16]:
# run DESCRIBE table to verify data types have not changed

q = """
    DESCRIBE genres;
    """
pd.read_sql(q, conn)

        Field         Type Null  Key Default           Extra
0    genre_id          int   NO  PRI    None  auto_increment
1  genre_name  varchar(45)  YES         None

In [17]:
# run DESCRIBE table to verify data types have not changed

q = """
    DESCRIBE ratings;
    """
pd.read_sql(q, conn)

                 Field         Type Null  Key Default Extra
0               tconst  varchar(10)   NO  PRI    None
1       average_rating        float  YES         None
2      number_of_votes          int  YES         None
3  title_basics_tconst  varchar(10)  YES         None

In [18]:
# run DESCRIBE table to verify data types have not changed

q = """
    DESCRIBE title_basics;
    """
pd.read_sql(q, conn)

           Field          Type Null  Key Default Extra
0         tconst   varchar(10)   NO  PRI    None
1  primary_title  varchar(242)  YES         None
2     start_year          year  YES         None
3        runtime           int  YES         None

In [19]:
# run DESCRIBE table to verify data types have not changed

q = """
    DESCRIBE title_basics_has_genres;
    """
pd.read_sql(q, conn)

      Field         Type Null  Key Default Extra
0    tconst  varchar(10)   NO  PRI    None
1  genre_id          int   NO  PRI    None

In [20]:
# preview first 5 rows with SELECT

q = """
    SELECT *
    FROM genres
    LIMIT 5;
    """
pd.read_sql(q, conn)

Empty DataFrame
Columns: [genre_id, genre_name]
Index: []

In [21]:
# preview first 5 rows with SELECT

q = """
    SELECT *
    FROM ratings
    LIMIT 5;
    """
pd.read_sql(q, conn)

      tconst  average_rating  number_of_votes title_basics_tconst
0  tt0035423             6.4            87153                None
1  tt0062336             6.4              175                None
2  tt0069049             6.7             7754                None
3  tt0088751             5.2              336                None
4  tt0096056             5.6              846                None

In [22]:
# preview first 5 rows with SELECT

q = """
    SELECT *
    FROM title_basics
    LIMIT 5;
    """
pd.read_sql(q, conn)

,tconst,primary_title,start_year,runtime
0,tt0035423,Kate & Leopold,2001,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,70
2,tt0069049,The Other Side of the Wind,2018,122
3,tt0088751,The Naked Monster,2005,100
4,tt0096056,Crime and Punishment,2002,126

In [23]:
# preview first 5 rows with SELECT

q = """
    SELECT *
    FROM title_basics_has_genres
    LIMIT 5;
    """
pd.read_sql(q, conn)

Empty DataFrame
Columns: [tconst, genre_id]
Index: []